MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q43/mcu.h
extern volatile ZCDCONbits_t ZCDCONbits __at(0x04C);
// bitfield macros
#define _ZCDCON_INTN_POSN                                   0x0
#define _ZCDCON_INTN_POSITION                               0x0
#define _ZCDCON_INTN_SIZE                                   0x1
#define _ZCDCON_INTN_LENGTH                                 0x1
#define _ZCDCON_INTN_MASK                                   0x1
#define _ZCDCON_INTP_POSN                                   0x1
#define _ZCDCON_INTP_POSITION                               0x1
#define _ZCDCON_INTP_SIZE                                   0x1
#define _ZCDCON_INTP_LENGTH                                 0x1
#define _ZCDCON_INTP_MASK                                   0x2
#define _ZCDCON_POL_POSN                                    0x4
#define _ZCDCON_POL_POSITION                                0x4
#define _ZCDCON_POL_SIZE                                    0x1
#define _ZCDCON_POL_LENGTH                                  0x1
#define _ZCDCON_POL_MASK                                    0x10
#define _ZCDCON_OUT_POSN                                    0x5
#define _ZCDCON_OUT_POSITION                                0x5
#define _ZCDCON_OUT_SIZE                                    0x1
#define _ZCDCON_OUT_LENGTH                                  0x1
#define _ZCDCON_OUT_MASK                                    0x20
#define _ZCDCON_SEN_POSN                                    0x7
#define _ZCDCON_SEN_POSITION                                0x7
#define _ZCDCON_SEN_SIZE                                    0x1
#define _ZCDCON_SEN_LENGTH                                  0x1
#define _ZCDCON_SEN_MASK                                    0x80
#define _ZCDCON_ZCDINTN_POSN                                0x0
#define _ZCDCON_ZCDINTN_POSITION                            0x0
#define _ZCDCON_ZCDINTN_SIZE                                0x1
#define _ZCDCON_ZCDINTN_LENGTH                              0x1
#define _ZCDCON_ZCDINTN_MASK                                0x1
#define _ZCDCON_ZCDINTP_POSN                                0x1
#define _ZCDCON_ZCDINTP_POSITION                            0x1
#define _ZCDCON_ZCDINTP_SIZE                                0x1
#define _ZCDCON_ZCDINTP_LENGTH                              0x1
#define _ZCDCON_ZCDINTP_MASK                                0x2
#define _ZCDCON_ZCDPOL_POSN                                 0x4
#define _ZCDCON_ZCDPOL_POSITION                             0x4
#define _ZCDCON_ZCDPOL_SIZE                                 0x1
#define _ZCDCON_ZCDPOL_LENGTH                               0x1
#define _ZCDCON_ZCDPOL_MASK                                 0x10
#define _ZCDCON_ZCDOUT_POSN                                 0x5
#define _ZCDCON_ZCDOUT_POSITION                             0x5
#define _ZCDCON_ZCDOUT_SIZE                                 0x1
#define _ZCDCON_ZCDOUT_LENGTH                               0x1
#define _ZCDCON_ZCDOUT_MASK                                 0x20
#define _ZCDCON_ZCDSEN_POSN                                 0x7
#define _ZCDCON_ZCDSEN_POSITION                             0x7
#define _ZCDCON_ZCDSEN_SIZE                                 0x1
#define _ZCDCON_ZCDSEN_LENGTH                               0x1
#define _ZCDCON_ZCDSEN_MASK                                 0x80

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0x060);
#ifndef _LIB_BUILD
asm("PMD0 equ 060h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned IOCMD                  :1;
        unsigned CLKRMD                 :1;
        unsigned                        :1;
        unsigned SCANMD                 :1;
        unsigned CRCMD                  :1;
        unsigned HLVDMD                 :1;
        unsigned FVRMD                  :1;
        unsigned SYSCMD                 :1;
    };
} PMD0bits_t;
extern volatile PMD0bits_t PMD0bits __at(0x060);
// bitfield macros
#define _PMD0_IOCMD_POSN                                    0x0
#define _PMD0_IOCMD_POSITION                                0x0
#define _PMD0_IOCMD_SIZE                                    0x1
#define _PMD0_IOCMD_LENGTH                                  0x1
#define _PMD0_IOCMD_MASK                                    0x1
#define _PMD0_CLKRMD_POSN                                   0x1
#define _PMD0_CLKRMD_POSITION                               0x1
#define _PMD0_CLKRMD_SIZE                                   0x1
#define _PMD0_CLKRMD_LENGTH                                 0x1
#define _PMD0_CLKRMD_MASK                                   0x2
#define _PMD0_SCANMD_POSN                                   0x3
#define _PMD0_SCANMD_POSITION                               0x3
#define _PMD0_SCANMD_SIZE                                   0x1
#define _PMD0_SCANMD_LENGTH                                 0x1
#define _PMD0_SCANMD_MASK                                   0x8
#define _PMD0_CRCMD_POSN                                    0x4
#define _PMD0_CRCMD_POSITION                                0x4
#define _PMD0_CRCMD_SIZE                                    0x1
#define _PMD0_CRCMD_LENGTH                                  0x1
#define _PMD0_CRCMD_MASK                                    0x10
#define _PMD0_HLVDMD_POSN                                   0x5
#define _PMD0_HLVDMD_POSITION                               0x5
#define _PMD0_HLVDMD_SIZE                                   0x1
#define _PMD0_HLVDMD_LENGTH                                 0x1
#define _PMD0_HLVDMD_MASK                                   0x20
#define _PMD0_FVRMD_POSN                                    0x6
#define _PMD0_FVRMD_POSITION                                0x6
#define _PMD0_FVRMD_SIZE                                    0x1
#define _PMD0_FVRMD_LENGTH                                  0x1
#define _PMD0_FVRMD_MASK                                    0x40
#define _PMD0_SYSCMD_POSN                                   0x7
#define _PMD0_SYSCMD_POSITION                               0x7
#define _PMD0_SYSCMD_SIZE                                   0x1
#define _PMD0_SYSCMD_LENGTH                                 0x1
#define _PMD0_SYSCMD_MASK                                   0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0x061);
#ifndef _LIB_BUILD
asm("PMD1 equ 061h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR0MD                 :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned SMT1MD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0x061);
// bitfield macros
#define _PMD1_TMR0MD_POSN                                   0x0
#define _PMD1_TMR0MD_POSITION                               0x0
#define _PMD1_TMR0MD_SIZE                                   0x1
#define _PMD1_TMR0MD_LENGTH                                 0x1
#define _PMD1_TMR0MD_MASK                                   0x1
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_TMR5MD_POSN                                   0x5
#define _PMD1_TMR5MD_POSITION                               0x5
#define _PMD1_TMR5MD_SIZE                                   0x1
#define _PMD1_TMR5MD_LENGTH                                 0x1
#define _PMD1_TMR5MD_MASK                                   0x20
#define _PMD1_TMR6MD_POSN                                   0x6
#define _PMD1_TMR6MD_POSITION                               0x6
#define _PMD1_TMR6MD_SIZE                                   0x1
#define _PMD1_TMR6MD_LENGTH                                 0x1
#define _PMD1_TMR6MD_MASK                                   0x40
#define _PMD1_SMT1MD_POSN                                   0x7
#define _PMD1_SMT1MD_POSITION                               0x7
#define _PMD1_SMT1MD_SIZE                                   0x1
#define _PMD1_SMT1MD_LENGTH                                 0x1
#define _PMD1_SMT1MD_MASK                                   0x80

// Register: PMD3
#define PMD3 PMD3
extern volatile unsigned char           PMD3                __at(0x063);
#ifndef _LIB_BUILD
asm("PMD3 equ 063h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ZCDMD                  :1;
        unsigned CM1MD                  :1;
        unsigned CM2MD                  :1;
        unsigned                        :2;
        unsigned ADCMD                  :1;
        unsigned DAC1MD                 :1;
        unsigned ACTMD                  :1;
    };
} PMD3bits_t;
extern volatile PMD3bits_t PMD3bits __at(0x063);
// bitfield macros
#define _PMD3_ZCDMD_POSN                                    0x0
#define _PMD3_ZCDMD_POSITION                                0x0
#define _PMD3_ZCDMD_SIZE                                    0x1
#define _PMD3_ZCDMD_LENGTH                                  0x1
#define _PMD3_ZCDMD_MASK                                    0x1
#define _PMD3_CM1MD_POSN                                    0x1
#define _PMD3_CM1MD_POSITION                                0x1
#define _PMD3_CM1MD_SIZE                                    0x1
#define _PMD3_CM1MD_LENGTH                                  0x1
#define _PMD3_CM1MD_MASK                                    0x2
#define _PMD3_CM2MD_POSN                                    0x2
#define _PMD3_CM2MD_POSITION                                0x2
#define _PMD3_CM2MD_SIZE                                    0x1
#define _PMD3_CM2MD_LENGTH                                  0x1
#define _PMD3_CM2MD_MASK                                    0x4
#define _PMD3_ADCMD_POSN                                    0x5
#define _PMD3_ADCMD_POSITION                                0x5
#define _PMD3_ADCMD_SIZE                                    0x1
#define _PMD3_ADCMD_LENGTH                                  0x1
#define _PMD3_ADCMD_MASK                                    0x20
#define _PMD3_DAC1MD_POSN                                   0x6
#define _PMD3_DAC1MD_POSITION                               0x6
#define _PMD3_DAC1MD_SIZE                                   0x1
#define _PMD3_DAC1MD_LENGTH                                 0x1
#define _PMD3_DAC1MD_MASK                                   0x40
#define _PMD3_ACTMD_POSN                                    0x7
#define _PMD3_ACTMD_POSITION                                0x7
#define _PMD3_ACTMD_SIZE                                    0x1
#define _PMD3_ACTMD_LENGTH                                  0x1
#define _PMD3_ACTMD_MASK                                    0x80

// Register: PMD4
#define PMD4 PMD4
extern volatile unsigned char           PMD4                __at(0x064);
#ifndef _LIB_BUILD
asm("PMD4 equ 064h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NCO1MD                 :1;
        unsigned NCO2MD                 :1;
        unsigned NCO3MD                 :1;
        unsigned DSM1MD                 :1;
        unsigned CWG1MD                 :1;
        unsigned CWG2MD                 :1;
        unsigned CWG3MD                 :1;
    };
} PMD4bits_t;
extern volatile PMD4bits_t PMD4bits __at(0x064);
// bitfield macros
#define _PMD4_NCO1MD_POSN                                   0x0
#define _PMD4_NCO1MD_POSITION                               0x0
#define _PMD4_NCO1MD_SIZE                                   0x1
#define _PMD4_NCO1MD_LENGTH                                 0x1
#define _PMD4_NCO1MD_MASK                                   0x1
#define _PMD4_NCO2MD_POSN                                   0x1
#define _PMD4_NCO2MD_POSITION                               0x1
#define _PMD4_NCO2MD_SIZE                                   0x1
#define _PMD4_NCO2MD_LENGTH                                 0x1
#define _PMD4_NCO2MD_MASK                                   0x2
#define _PMD4_NCO3MD_POSN                                   0x2
#define _PMD4_NCO3MD_POSITION                               0x2
#define _PMD4_NCO3MD_SIZE                                   0x1
#define _PMD4_NCO3MD_LENGTH                                 0x1
#define _PMD4_NCO3MD_MASK                                   0x4
#define _PMD4_DSM1MD_POSN                                   0x3
#define _PMD4_DSM1MD_POSITION                               0x3
#define _PMD4_DSM1MD_SIZE                                   0x1
#define _PMD4_DSM1MD_LENGTH                                 0x1
#define _PMD4_DSM1MD_MASK                                   0x8
#define _PMD4_CWG1MD_POSN                                   0x4
#define _PMD4_CWG1MD_POSITION                               0x4
#define _PMD4_CWG1MD_SIZE                                   0x1
#define _PMD4_CWG1MD_LENGTH                                 0x1
#define _PMD4_CWG1MD_MASK                                   0x10
#define _PMD4_CWG2MD_POSN                                   0x5
#define _PMD4_CWG2MD_POSITION                               0x5
#define _PMD4_CWG2MD_SIZE                                   0x1
#define _PMD4_CWG2MD_LENGTH                                 0x1
#define _PMD4_CWG2MD_MASK                                   0x20
#define _PMD4_CWG3MD_POSN                                   0x6
#define _PMD4_CWG3MD_POSITION                               0x6
#define _PMD4_CWG3MD_SIZE                                   0x1
#define _PMD4_CWG3MD_LENGTH                                 0x1
#define _PMD4_CWG3MD_MASK                                   0x40

// Register: PMD5
#define PMD5 PMD5
extern volatile unsigned char           PMD5                __at(0x065);
#ifndef _LIB_BUILD
asm("PMD5 equ 065h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
        unsigned                        :1;
        unsigned PWM1MD                 :1;
        unsigned PWM2MD                 :1;
        unsigned PWM3MD                 :1;
    };
} PMD5bits_t;
