MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q43/mcu.h
// Register: U4ERRIE
#define U4ERRIE U4ERRIE
extern volatile unsigned char           U4ERRIE             __at(0x2EC);
#ifndef _LIB_BUILD
asm("U4ERRIE equ 02ECh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXCIE                  :1;
        unsigned RXFOIE                 :1;
        unsigned RXBKIE                 :1;
        unsigned FERIE                  :1;
        unsigned CERIE                  :1;
        unsigned ABDOVE                 :1;
        unsigned PERIE                  :1;
        unsigned TXMTIE                 :1;
    };
    struct {
        unsigned U4TXCIE                :1;
        unsigned U4RXFOIE               :1;
        unsigned U4RXBKIE               :1;
        unsigned U4FERIE                :1;
        unsigned U4CERIE                :1;
        unsigned U4ABDOVE               :1;
        unsigned U4PERIE                :1;
        unsigned U4TXMTIE               :1;
    };
} U4ERRIEbits_t;
extern volatile U4ERRIEbits_t U4ERRIEbits __at(0x2EC);
// bitfield macros
#define _U4ERRIE_TXCIE_POSN                                 0x0
#define _U4ERRIE_TXCIE_POSITION                             0x0
#define _U4ERRIE_TXCIE_SIZE                                 0x1
#define _U4ERRIE_TXCIE_LENGTH                               0x1
#define _U4ERRIE_TXCIE_MASK                                 0x1
#define _U4ERRIE_RXFOIE_POSN                                0x1
#define _U4ERRIE_RXFOIE_POSITION                            0x1
#define _U4ERRIE_RXFOIE_SIZE                                0x1
#define _U4ERRIE_RXFOIE_LENGTH                              0x1
#define _U4ERRIE_RXFOIE_MASK                                0x2
#define _U4ERRIE_RXBKIE_POSN                                0x2
#define _U4ERRIE_RXBKIE_POSITION                            0x2
#define _U4ERRIE_RXBKIE_SIZE                                0x1
#define _U4ERRIE_RXBKIE_LENGTH                              0x1
#define _U4ERRIE_RXBKIE_MASK                                0x4
#define _U4ERRIE_FERIE_POSN                                 0x3
#define _U4ERRIE_FERIE_POSITION                             0x3
#define _U4ERRIE_FERIE_SIZE                                 0x1
#define _U4ERRIE_FERIE_LENGTH                               0x1
#define _U4ERRIE_FERIE_MASK                                 0x8
#define _U4ERRIE_CERIE_POSN                                 0x4
#define _U4ERRIE_CERIE_POSITION                             0x4
#define _U4ERRIE_CERIE_SIZE                                 0x1
#define _U4ERRIE_CERIE_LENGTH                               0x1
#define _U4ERRIE_CERIE_MASK                                 0x10
#define _U4ERRIE_ABDOVE_POSN                                0x5
#define _U4ERRIE_ABDOVE_POSITION                            0x5
#define _U4ERRIE_ABDOVE_SIZE                                0x1
#define _U4ERRIE_ABDOVE_LENGTH                              0x1
#define _U4ERRIE_ABDOVE_MASK                                0x20
#define _U4ERRIE_PERIE_POSN                                 0x6
#define _U4ERRIE_PERIE_POSITION                             0x6
#define _U4ERRIE_PERIE_SIZE                                 0x1
#define _U4ERRIE_PERIE_LENGTH                               0x1
#define _U4ERRIE_PERIE_MASK                                 0x40
#define _U4ERRIE_TXMTIE_POSN                                0x7
#define _U4ERRIE_TXMTIE_POSITION                            0x7
#define _U4ERRIE_TXMTIE_SIZE                                0x1
#define _U4ERRIE_TXMTIE_LENGTH                              0x1
#define _U4ERRIE_TXMTIE_MASK                                0x80
#define _U4ERRIE_U4TXCIE_POSN                               0x0
#define _U4ERRIE_U4TXCIE_POSITION                           0x0
#define _U4ERRIE_U4TXCIE_SIZE                               0x1
#define _U4ERRIE_U4TXCIE_LENGTH                             0x1
#define _U4ERRIE_U4TXCIE_MASK                               0x1
#define _U4ERRIE_U4RXFOIE_POSN                              0x1
#define _U4ERRIE_U4RXFOIE_POSITION                          0x1
#define _U4ERRIE_U4RXFOIE_SIZE                              0x1
#define _U4ERRIE_U4RXFOIE_LENGTH                            0x1
#define _U4ERRIE_U4RXFOIE_MASK                              0x2
#define _U4ERRIE_U4RXBKIE_POSN                              0x2
#define _U4ERRIE_U4RXBKIE_POSITION                          0x2
#define _U4ERRIE_U4RXBKIE_SIZE                              0x1
#define _U4ERRIE_U4RXBKIE_LENGTH                            0x1
#define _U4ERRIE_U4RXBKIE_MASK                              0x4
#define _U4ERRIE_U4FERIE_POSN                               0x3
#define _U4ERRIE_U4FERIE_POSITION                           0x3
#define _U4ERRIE_U4FERIE_SIZE                               0x1
#define _U4ERRIE_U4FERIE_LENGTH                             0x1
#define _U4ERRIE_U4FERIE_MASK                               0x8
#define _U4ERRIE_U4CERIE_POSN                               0x4
#define _U4ERRIE_U4CERIE_POSITION                           0x4
#define _U4ERRIE_U4CERIE_SIZE                               0x1
#define _U4ERRIE_U4CERIE_LENGTH                             0x1
#define _U4ERRIE_U4CERIE_MASK                               0x10
#define _U4ERRIE_U4ABDOVE_POSN                              0x5
#define _U4ERRIE_U4ABDOVE_POSITION                          0x5
#define _U4ERRIE_U4ABDOVE_SIZE                              0x1
#define _U4ERRIE_U4ABDOVE_LENGTH                            0x1
#define _U4ERRIE_U4ABDOVE_MASK                              0x20
#define _U4ERRIE_U4PERIE_POSN                               0x6
#define _U4ERRIE_U4PERIE_POSITION                           0x6
#define _U4ERRIE_U4PERIE_SIZE                               0x1
#define _U4ERRIE_U4PERIE_LENGTH                             0x1
#define _U4ERRIE_U4PERIE_MASK                               0x40
#define _U4ERRIE_U4TXMTIE_POSN                              0x7
#define _U4ERRIE_U4TXMTIE_POSITION                          0x7
#define _U4ERRIE_U4TXMTIE_SIZE                              0x1
#define _U4ERRIE_U4TXMTIE_LENGTH                            0x1
#define _U4ERRIE_U4TXMTIE_MASK                              0x80

// Register: U5RXB
#define U5RXB U5RXB
extern volatile unsigned char           U5RXB               __at(0x2ED);
#ifndef _LIB_BUILD
asm("U5RXB equ 02EDh");
#endif
// aliases
extern volatile unsigned char           U5RXBL              __at(0x2ED);
#ifndef _LIB_BUILD
asm("U5RXBL equ 02EDh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U5RXBbits_t;
extern volatile U5RXBbits_t U5RXBbits __at(0x2ED);
// bitfield macros
#define _U5RXB_RXB_POSN                                     0x0
#define _U5RXB_RXB_POSITION                                 0x0
#define _U5RXB_RXB_SIZE                                     0x8
#define _U5RXB_RXB_LENGTH                                   0x8
#define _U5RXB_RXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned RXB                    :8;
    };
} U5RXBLbits_t;
extern volatile U5RXBLbits_t U5RXBLbits __at(0x2ED);
// bitfield macros
#define _U5RXBL_RXB_POSN                                    0x0
#define _U5RXBL_RXB_POSITION                                0x0
#define _U5RXBL_RXB_SIZE                                    0x8
#define _U5RXBL_RXB_LENGTH                                  0x8
#define _U5RXBL_RXB_MASK                                    0xFF

// Register: U5TXB
#define U5TXB U5TXB
extern volatile unsigned char           U5TXB               __at(0x2EF);
#ifndef _LIB_BUILD
asm("U5TXB equ 02EFh");
#endif
// aliases
extern volatile unsigned char           U5TXBL              __at(0x2EF);
#ifndef _LIB_BUILD
asm("U5TXBL equ 02EFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U5TXBbits_t;
extern volatile U5TXBbits_t U5TXBbits __at(0x2EF);
// bitfield macros
#define _U5TXB_TXB_POSN                                     0x0
#define _U5TXB_TXB_POSITION                                 0x0
#define _U5TXB_TXB_SIZE                                     0x8
#define _U5TXB_TXB_LENGTH                                   0x8
#define _U5TXB_TXB_MASK                                     0xFF
// alias bitfield definitions
typedef union {
    struct {
        unsigned TXB                    :8;
    };
} U5TXBLbits_t;
extern volatile U5TXBLbits_t U5TXBLbits __at(0x2EF);
// bitfield macros
#define _U5TXBL_TXB_POSN                                    0x0
#define _U5TXBL_TXB_POSITION                                0x0
#define _U5TXBL_TXB_SIZE                                    0x8
#define _U5TXBL_TXB_LENGTH                                  0x8
#define _U5TXBL_TXB_MASK                                    0xFF

// Register: U5P1
#define U5P1 U5P1
extern volatile unsigned char           U5P1                __at(0x2F1);
#ifndef _LIB_BUILD
asm("U5P1 equ 02F1h");
#endif

// Register: U5P1L
#define U5P1L U5P1L
extern volatile unsigned char           U5P1L               __at(0x2F1);
#ifndef _LIB_BUILD
asm("U5P1L equ 02F1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P1L                    :8;
    };
} U5P1Lbits_t;
