MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q43/mcu.h
extern volatile IPR1bits_t IPR1bits __at(0x363);
// bitfield macros
#define _IPR1_INT0IP_POSN                                   0x0
#define _IPR1_INT0IP_POSITION                               0x0
#define _IPR1_INT0IP_SIZE                                   0x1
#define _IPR1_INT0IP_LENGTH                                 0x1
#define _IPR1_INT0IP_MASK                                   0x1
#define _IPR1_ZCDIP_POSN                                    0x1
#define _IPR1_ZCDIP_POSITION                                0x1
#define _IPR1_ZCDIP_SIZE                                    0x1
#define _IPR1_ZCDIP_LENGTH                                  0x1
#define _IPR1_ZCDIP_MASK                                    0x2
#define _IPR1_ADIP_POSN                                     0x2
#define _IPR1_ADIP_POSITION                                 0x2
#define _IPR1_ADIP_SIZE                                     0x1
#define _IPR1_ADIP_LENGTH                                   0x1
#define _IPR1_ADIP_MASK                                     0x4
#define _IPR1_ACTIP_POSN                                    0x3
#define _IPR1_ACTIP_POSITION                                0x3
#define _IPR1_ACTIP_SIZE                                    0x1
#define _IPR1_ACTIP_LENGTH                                  0x1
#define _IPR1_ACTIP_MASK                                    0x8
#define _IPR1_C1IP_POSN                                     0x4
#define _IPR1_C1IP_POSITION                                 0x4
#define _IPR1_C1IP_SIZE                                     0x1
#define _IPR1_C1IP_LENGTH                                   0x1
#define _IPR1_C1IP_MASK                                     0x10
#define _IPR1_SMT1IP_POSN                                   0x5
#define _IPR1_SMT1IP_POSITION                               0x5
#define _IPR1_SMT1IP_SIZE                                   0x1
#define _IPR1_SMT1IP_LENGTH                                 0x1
#define _IPR1_SMT1IP_MASK                                   0x20
#define _IPR1_SMT1PRAIP_POSN                                0x6
#define _IPR1_SMT1PRAIP_POSITION                            0x6
#define _IPR1_SMT1PRAIP_SIZE                                0x1
#define _IPR1_SMT1PRAIP_LENGTH                              0x1
#define _IPR1_SMT1PRAIP_MASK                                0x40
#define _IPR1_SMT1PWAIP_POSN                                0x7
#define _IPR1_SMT1PWAIP_POSITION                            0x7
#define _IPR1_SMT1PWAIP_SIZE                                0x1
#define _IPR1_SMT1PWAIP_LENGTH                              0x1
#define _IPR1_SMT1PWAIP_MASK                                0x80

// Register: IPR2
#define IPR2 IPR2
extern volatile unsigned char           IPR2                __at(0x364);
#ifndef _LIB_BUILD
asm("IPR2 equ 0364h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADTIP                  :1;
        unsigned                        :3;
        unsigned DMA1SCNTIP             :1;
        unsigned DMA1DCNTIP             :1;
        unsigned DMA1ORIP               :1;
        unsigned DMA1AIP                :1;
    };
} IPR2bits_t;
extern volatile IPR2bits_t IPR2bits __at(0x364);
// bitfield macros
#define _IPR2_ADTIP_POSN                                    0x0
#define _IPR2_ADTIP_POSITION                                0x0
#define _IPR2_ADTIP_SIZE                                    0x1
#define _IPR2_ADTIP_LENGTH                                  0x1
#define _IPR2_ADTIP_MASK                                    0x1
#define _IPR2_DMA1SCNTIP_POSN                               0x4
#define _IPR2_DMA1SCNTIP_POSITION                           0x4
#define _IPR2_DMA1SCNTIP_SIZE                               0x1
#define _IPR2_DMA1SCNTIP_LENGTH                             0x1
#define _IPR2_DMA1SCNTIP_MASK                               0x10
#define _IPR2_DMA1DCNTIP_POSN                               0x5
#define _IPR2_DMA1DCNTIP_POSITION                           0x5
#define _IPR2_DMA1DCNTIP_SIZE                               0x1
#define _IPR2_DMA1DCNTIP_LENGTH                             0x1
#define _IPR2_DMA1DCNTIP_MASK                               0x20
#define _IPR2_DMA1ORIP_POSN                                 0x6
#define _IPR2_DMA1ORIP_POSITION                             0x6
#define _IPR2_DMA1ORIP_SIZE                                 0x1
#define _IPR2_DMA1ORIP_LENGTH                               0x1
#define _IPR2_DMA1ORIP_MASK                                 0x40
#define _IPR2_DMA1AIP_POSN                                  0x7
#define _IPR2_DMA1AIP_POSITION                              0x7
#define _IPR2_DMA1AIP_SIZE                                  0x1
#define _IPR2_DMA1AIP_LENGTH                                0x1
#define _IPR2_DMA1AIP_MASK                                  0x80

// Register: IPR3
#define IPR3 IPR3
extern volatile unsigned char           IPR3                __at(0x365);
#ifndef _LIB_BUILD
asm("IPR3 equ 0365h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SPI1RXIP               :1;
        unsigned SPI1TXIP               :1;
        unsigned SPI1IP                 :1;
        unsigned TMR2IP                 :1;
        unsigned TMR1IP                 :1;
        unsigned TMR1GIP                :1;
        unsigned CCP1IP                 :1;
        unsigned TMR0IP                 :1;
    };
} IPR3bits_t;
extern volatile IPR3bits_t IPR3bits __at(0x365);
// bitfield macros
#define _IPR3_SPI1RXIP_POSN                                 0x0
#define _IPR3_SPI1RXIP_POSITION                             0x0
#define _IPR3_SPI1RXIP_SIZE                                 0x1
#define _IPR3_SPI1RXIP_LENGTH                               0x1
#define _IPR3_SPI1RXIP_MASK                                 0x1
#define _IPR3_SPI1TXIP_POSN                                 0x1
#define _IPR3_SPI1TXIP_POSITION                             0x1
#define _IPR3_SPI1TXIP_SIZE                                 0x1
#define _IPR3_SPI1TXIP_LENGTH                               0x1
#define _IPR3_SPI1TXIP_MASK                                 0x2
#define _IPR3_SPI1IP_POSN                                   0x2
#define _IPR3_SPI1IP_POSITION                               0x2
#define _IPR3_SPI1IP_SIZE                                   0x1
#define _IPR3_SPI1IP_LENGTH                                 0x1
#define _IPR3_SPI1IP_MASK                                   0x4
#define _IPR3_TMR2IP_POSN                                   0x3
#define _IPR3_TMR2IP_POSITION                               0x3
#define _IPR3_TMR2IP_SIZE                                   0x1
#define _IPR3_TMR2IP_LENGTH                                 0x1
#define _IPR3_TMR2IP_MASK                                   0x8
#define _IPR3_TMR1IP_POSN                                   0x4
#define _IPR3_TMR1IP_POSITION                               0x4
#define _IPR3_TMR1IP_SIZE                                   0x1
#define _IPR3_TMR1IP_LENGTH                                 0x1
#define _IPR3_TMR1IP_MASK                                   0x10
#define _IPR3_TMR1GIP_POSN                                  0x5
#define _IPR3_TMR1GIP_POSITION                              0x5
#define _IPR3_TMR1GIP_SIZE                                  0x1
#define _IPR3_TMR1GIP_LENGTH                                0x1
#define _IPR3_TMR1GIP_MASK                                  0x20
#define _IPR3_CCP1IP_POSN                                   0x6
#define _IPR3_CCP1IP_POSITION                               0x6
#define _IPR3_CCP1IP_SIZE                                   0x1
#define _IPR3_CCP1IP_LENGTH                                 0x1
#define _IPR3_CCP1IP_MASK                                   0x40
#define _IPR3_TMR0IP_POSN                                   0x7
#define _IPR3_TMR0IP_POSITION                               0x7
#define _IPR3_TMR0IP_SIZE                                   0x1
#define _IPR3_TMR0IP_LENGTH                                 0x1
#define _IPR3_TMR0IP_MASK                                   0x80

