MikroElektronika/core_packages/PIC/XC8/def/PIC18F47Q43/mcu.h
extern volatile ADREFbits_t ADREFbits __at(0x3F8);
// bitfield macros
#define _ADREF_PREF_POSN                                    0x0
#define _ADREF_PREF_POSITION                                0x0
#define _ADREF_PREF_SIZE                                    0x4
#define _ADREF_PREF_LENGTH                                  0x4
#define _ADREF_PREF_MASK                                    0xF
#define _ADREF_NREF_POSN                                    0x4
#define _ADREF_NREF_POSITION                                0x4
#define _ADREF_NREF_SIZE                                    0x4
#define _ADREF_NREF_LENGTH                                  0x4
#define _ADREF_NREF_MASK                                    0xF0
#define _ADREF_ADPREF_POSN                                  0x0
#define _ADREF_ADPREF_POSITION                              0x0
#define _ADREF_ADPREF_SIZE                                  0x4
#define _ADREF_ADPREF_LENGTH                                0x4
#define _ADREF_ADPREF_MASK                                  0xF
#define _ADREF_ADNREF_POSN                                  0x4
#define _ADREF_ADNREF_POSITION                              0x4
#define _ADREF_ADNREF_SIZE                                  0x4
#define _ADREF_ADNREF_LENGTH                                0x4
#define _ADREF_ADNREF_MASK                                  0xF0
#define _ADREF_PREF0_POSN                                   0x0
#define _ADREF_PREF0_POSITION                               0x0
#define _ADREF_PREF0_SIZE                                   0x1
#define _ADREF_PREF0_LENGTH                                 0x1
#define _ADREF_PREF0_MASK                                   0x1
#define _ADREF_PREF1_POSN                                   0x1
#define _ADREF_PREF1_POSITION                               0x1
#define _ADREF_PREF1_SIZE                                   0x1
#define _ADREF_PREF1_LENGTH                                 0x1
#define _ADREF_PREF1_MASK                                   0x2
#define _ADREF_NREF0_POSN                                   0x4
#define _ADREF_NREF0_POSITION                               0x4
#define _ADREF_NREF0_SIZE                                   0x1
#define _ADREF_NREF0_LENGTH                                 0x1
#define _ADREF_NREF0_MASK                                   0x10
#define _ADREF_ADPREF0_POSN                                 0x0
#define _ADREF_ADPREF0_POSITION                             0x0
#define _ADREF_ADPREF0_SIZE                                 0x1
#define _ADREF_ADPREF0_LENGTH                               0x1
#define _ADREF_ADPREF0_MASK                                 0x1
#define _ADREF_ADPREF1_POSN                                 0x1
#define _ADREF_ADPREF1_POSITION                             0x1
#define _ADREF_ADPREF1_SIZE                                 0x1
#define _ADREF_ADPREF1_LENGTH                               0x1
#define _ADREF_ADPREF1_MASK                                 0x2
#define _ADREF_ADNREF0_POSN                                 0x4
#define _ADREF_ADNREF0_POSITION                             0x4
#define _ADREF_ADNREF0_SIZE                                 0x1
#define _ADREF_ADNREF0_LENGTH                               0x1
#define _ADREF_ADNREF0_MASK                                 0x10

// Register: ADACT
#define ADACT ADACT
extern volatile unsigned char           ADACT               __at(0x3F9);
#ifndef _LIB_BUILD
asm("ADACT equ 03F9h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACT                    :8;
    };
    struct {
        unsigned ADACT0                 :1;
        unsigned ADACT1                 :1;
        unsigned ADACT2                 :1;
        unsigned ADACT3                 :1;
        unsigned ADACT4                 :1;
        unsigned ADACT5                 :1;
    };
    struct {
        unsigned ADACT                  :8;
    };
    struct {
        unsigned ACT0                   :1;
        unsigned ACT1                   :1;
        unsigned ACT2                   :1;
        unsigned ACT3                   :1;
        unsigned ACT4                   :1;
        unsigned ACT5                   :1;
    };
} ADACTbits_t;
extern volatile ADACTbits_t ADACTbits __at(0x3F9);
// bitfield macros
#define _ADACT_ACT_POSN                                     0x0
#define _ADACT_ACT_POSITION                                 0x0
#define _ADACT_ACT_SIZE                                     0x8
#define _ADACT_ACT_LENGTH                                   0x8
#define _ADACT_ACT_MASK                                     0xFF
#define _ADACT_ADACT0_POSN                                  0x0
#define _ADACT_ADACT0_POSITION                              0x0
#define _ADACT_ADACT0_SIZE                                  0x1
#define _ADACT_ADACT0_LENGTH                                0x1
#define _ADACT_ADACT0_MASK                                  0x1
#define _ADACT_ADACT1_POSN                                  0x1
#define _ADACT_ADACT1_POSITION                              0x1
#define _ADACT_ADACT1_SIZE                                  0x1
#define _ADACT_ADACT1_LENGTH                                0x1
#define _ADACT_ADACT1_MASK                                  0x2
#define _ADACT_ADACT2_POSN                                  0x2
#define _ADACT_ADACT2_POSITION                              0x2
#define _ADACT_ADACT2_SIZE                                  0x1
#define _ADACT_ADACT2_LENGTH                                0x1
#define _ADACT_ADACT2_MASK                                  0x4
#define _ADACT_ADACT3_POSN                                  0x3
#define _ADACT_ADACT3_POSITION                              0x3
#define _ADACT_ADACT3_SIZE                                  0x1
#define _ADACT_ADACT3_LENGTH                                0x1
#define _ADACT_ADACT3_MASK                                  0x8
#define _ADACT_ADACT4_POSN                                  0x4
#define _ADACT_ADACT4_POSITION                              0x4
#define _ADACT_ADACT4_SIZE                                  0x1
#define _ADACT_ADACT4_LENGTH                                0x1
#define _ADACT_ADACT4_MASK                                  0x10
#define _ADACT_ADACT5_POSN                                  0x5
#define _ADACT_ADACT5_POSITION                              0x5
#define _ADACT_ADACT5_SIZE                                  0x1
#define _ADACT_ADACT5_LENGTH                                0x1
#define _ADACT_ADACT5_MASK                                  0x20
#define _ADACT_ADACT_POSN                                   0x0
#define _ADACT_ADACT_POSITION                               0x0
#define _ADACT_ADACT_SIZE                                   0x8
#define _ADACT_ADACT_LENGTH                                 0x8
#define _ADACT_ADACT_MASK                                   0xFF
#define _ADACT_ACT0_POSN                                    0x0
#define _ADACT_ACT0_POSITION                                0x0
#define _ADACT_ACT0_SIZE                                    0x1
#define _ADACT_ACT0_LENGTH                                  0x1
#define _ADACT_ACT0_MASK                                    0x1
#define _ADACT_ACT1_POSN                                    0x1
#define _ADACT_ACT1_POSITION                                0x1
#define _ADACT_ACT1_SIZE                                    0x1
#define _ADACT_ACT1_LENGTH                                  0x1
#define _ADACT_ACT1_MASK                                    0x2
#define _ADACT_ACT2_POSN                                    0x2
#define _ADACT_ACT2_POSITION                                0x2
#define _ADACT_ACT2_SIZE                                    0x1
#define _ADACT_ACT2_LENGTH                                  0x1
#define _ADACT_ACT2_MASK                                    0x4
#define _ADACT_ACT3_POSN                                    0x3
#define _ADACT_ACT3_POSITION                                0x3
#define _ADACT_ACT3_SIZE                                    0x1
#define _ADACT_ACT3_LENGTH                                  0x1
#define _ADACT_ACT3_MASK                                    0x8
#define _ADACT_ACT4_POSN                                    0x4
#define _ADACT_ACT4_POSITION                                0x4
#define _ADACT_ACT4_SIZE                                    0x1
#define _ADACT_ACT4_LENGTH                                  0x1
#define _ADACT_ACT4_MASK                                    0x10
#define _ADACT_ACT5_POSN                                    0x5
#define _ADACT_ACT5_POSITION                                0x5
#define _ADACT_ACT5_SIZE                                    0x1
#define _ADACT_ACT5_LENGTH                                  0x1
#define _ADACT_ACT5_MASK                                    0x20

